# CanDisplayMinMax Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleField..::..CanDisplayMinMax Method
ScheduleField Class See Also
---
Indicates if this field can display minimum and maximum values.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public bool CanDisplayMinMax()
```

Visual Basic
---
```text
Public Function CanDisplayMinMax As Boolean
```

Visual C++
---
```text
public:
bool CanDisplayMinMax()
```

# ### Return Value
True if this field can display minimum and maximum values, false otherwise.
# See Also
ScheduleField Class
Autodesk.Revit.DB Namespace